// @strict-types
// @skip-check public-method-caching

// модуль ШифрованиеВызовСервераПовтИсп
//
#Область ПрограммныйИнтерфейс
	
// Есть право на шифрование.
// 
// Возвращаемое значение:
//  Булево - Есть право на шифрование
//
Функция ЕстьПравоНаШифрование() Экспорт
	//@skip-check using-isinrole
	Возврат РольДоступна("ЧтениеКлючейШифрования");
КонецФункции

// Обработать адрес временного хранилища.
// 
// Параметры:
//  Адрес - Строка - адрес временного хранилища
//  УИД - Строка, ЛюбаяСсылка - ключ шифрования (УникальныйИдентификатор)
// 
// Возвращаемое значение:
//  Строка - адрес временного хранилища
Функция ОбработатьАдресВременногоХранилища(Адрес, Знач УИД) Экспорт
	Попытка
		//@skip-check statement-type-change
		УИД = Новый УникальныйИдентификатор(УИД);
	Исключение
		Попытка
			//@skip-check statement-type-change
			//@skip-check dynamic-access-method-not-found
			УИД = УИД.УникальныйИдентификатор();
		Исключение
			ВызватьИсключение "Не удалось распознать параметр <УИД>";
		КонецПопытки;
	КонецПопытки;
	Возврат ШифрованиеСервер.ОбработатьАдресВременногоХранилища(Адрес, УИД);
КонецФункции

#КонецОбласти