// @strict-types
// @skip-check public-method-caching

//
#Область ПрограммныйИнтерфейс
	
// Есть право на шифрование.
// 
// Возвращаемое значение:
//  Булево - Есть право на шифрование
//
Функция ЕстьПравоНаШифрование() Экспорт
	//@skip-check using-isinrole
	Возврат РольДоступна("ЧтениеКлючейШифрования");
КонецФункции

// см. ШифрованиеСервер.ОбработатьАдресВременногоХранилища
Функция ОбработатьАдресВременногоХранилища(Адрес, УИД) Экспорт
	Возврат ШифрованиеСервер.ОбработатьАдресВременногоХранилища(Адрес, УИД);
КонецФункции

#КонецОбласти